import Header from '../components/header/Header';
import BackButton from '../components/backButton/backButton';
import PageTitle from '../components/pageTitle/pageTitle';
import styled from 'styled-components';

export default function ConfidentialPolicy() {
    return (
        <>
            <Header title="Політика Конфіденційності та файли Cookie" />

            <br />

            <Main>
                <BackButton />

                <br />
                <br />

                <PageTitle title="Політика Конфіденційності та файли Cookie" />

                <br />

                <Section>
                    <p>
                        Ця політика конфіденційності та файли cookie (надалі –
                        «Політика») пояснює, що ми будемо робити з вашою
                        особистою інформацією.
                    </p>

                    <br />

                    <p>
                        Ця Політика поширюється тільки на інформацію, зібрану на
                        нашому веб-сайті{' '}
                        <a href="https://chillvgamaky.if.ua">
                            https://chillvgamaky.if.ua
                        </a>
                        .
                    </p>
                </Section>

                <Section>
                    <SectionTitle>1. ТЕРМІНИ ТА ВИЗНАЧЕННЯ</SectionTitle>

                    <p>
                        1.1.«Веб-сайт» (надалі – «Сайт») – інформаційний ресурс
                        в мережі Інтернет, який розміщений за адресою{' '}
                        <a href="https://chillvgamaky.if.ua">
                            https://chillvgamaky.if.ua
                        </a>{' '}
                        та містить текстову, графічну та іншу інформацію, яка
                        сприймається як єдине ціле, та підтримується комплексом
                        системних програмних засобів.
                    </p>
                    <p>
                        1.2. «Власник Сайту» (надалі – «Власник») – ФОП Малько
                        Роман Євгенович, який є володільцем та розпорядником
                        персональних даних Користувачів Сайту.
                    </p>
                    <p>
                        1.3. «Користувач» – будь-яка фізична особа, яка
                        коли-небудь здійснювала доступ до Сайту та досягла віку,
                        допустимого для акцепту Угоди користувача розміщеної на
                        Сайті та цієї Політики.
                    </p>
                    <p>
                        1.4. «Аккаунт» – обліковий запис Користувача створений в
                        момент авторизації на Сайті, що дозволяє Власнику
                        ідентифікувати (авторизувати) Користувача шляхом
                        використання облікового запису Користувача в соціальних
                        мережах Facebook або Google.
                    </p>
                    <p>
                        1.5. «Персональні дані» – відомості чи сукупність
                        відомостей про Користувача, яка ідентифікована або може
                        бути конкретно ідентифікована.
                    </p>
                    <p>
                        1.6. «Послуги» (сервіси Сайту) – будь-які послуги, які
                        пропонуються на Сайті Власника.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        2. ЗБІР ТА ВИКОРИСТАННЯ ПЕРСОНАЛЬНИХ ДАНИХ
                    </SectionTitle>
                    <p>
                        2.1. Використання Сайту не вимагає реєстрації та/або
                        авторизації та безпосереднього надання персональних
                        даних, які можуть ідентифікувати Вас, крім випадку
                        передбаченого п. 2.2. Політики.
                    </p>
                    <p>
                        2.2 При оплаті послуги, користувач авторизується через
                        одну з соціальних мереж та Сайт отримує або
                        ідентифікатор користувача (id), або його імейл.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>3. ОБРОБКА ПЕРСОНАЛЬНИХ ДАНИХ</SectionTitle>
                    <p>
                        3.1 Персональна інформація не передається третім лицям,
                        а використовується виключно для статистики.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        4. МЕТА ВИКОРИСТАННЯ ПЕРСОНАЛЬНИХ ДАНИХ
                    </SectionTitle>
                    <p>
                        4.1 Ми використовуємо статистичні данні щоб краще
                        розуміти потреби людей та збільшити чи зменшити
                        кількість гамаків там, де потрібно.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        5. ТЕРМІН ЗБЕРІГАННЯ ПЕРСОНАЛЬНИХ ДАНИХ
                    </SectionTitle>
                    <p>
                        5.1. Персональні дані зберігаються на термін не більше,
                        ніж це необхідно відповідно до мети їх обробки.
                    </p>
                    <p>
                        5.2. Після того, як Ви перестали бути Користувачем Сайту
                        шляхом видалення свого Аккаунту на Сайті, ваші
                        персональні дані також автоматично видаляються.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        6. ВЗАЄМОДІЯ САЙТУ З ІНШИМИ РЕСУРСАМИ
                    </SectionTitle>
                    <p>
                        6.1 Персональна інформація не передається третім лицям,
                        а використовується виключно для статистики.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        7. ВЗАЄМОДІЯ ВЛАСНИКА З ТРЕТІМИ СТОРОНАМИ СТОСОВНО
                        ПЕРСОНАЛЬНИХ ДАНИХ
                    </SectionTitle>
                    <p>
                        7.1 Персональна інформація не передається третім лицям,
                        а використовується виключно для статистики.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>8. ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ</SectionTitle>
                    <p>
                        8.1. Ми використовуємо загальноприйняті стандарти
                        технологічного та операційного захисту інформації та
                        персональних даних від втрати, неправильного
                        використання, зміни або знищення, але ми не гарантуємо
                        абсолютну захищеність від будь-яких загроз, що виникають
                        поза межами нашого регулювання.
                    </p>
                    <p>
                        8.2. Ми забезпечуємо застосування всіх відповідних
                        зобов&#39;язань щодо дотримання конфіденційності, а
                        також технічних і організаційних заходів безпеки для
                        запобігання несанкціонованого або незаконного
                        розголошення або обробки такої інформації та даних, їх
                        випадкової втрати, знищення або пошкодження.
                    </p>
                    <p>
                        8.3. Ми маємо право поширювати персональні дані без
                        Вашої згоди у випадку визначеному чинним законодавством
                        України, і лише (якщо це необхідно) в інтересах
                        національної безпеки, економічного добробуту та прав
                        людини.
                    </p>
                    <p>
                        8.4. Якщо Ви надали / втратили доступ до свого Аккаунту,
                        Ви несете повну та самостійну відповідальність за дії
                        нового Користувача при використанні ним Сайту та/або
                        Послуг (сервісів) Сайту з Вашого Аккаунту.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        9. УМОВИ ДОСТУПУ ДО ПЕРСОНАЛЬНИХ ДАНИХ
                    </SectionTitle>
                    <p>
                        9.1. Порядок доступу до персональних даних третіми
                        сторонами визначається умовами згоди Користувача,
                        наданої Власнику на обробку цих даних, або відповідно до
                        вимог закону.
                    </p>
                    <p>
                        9.2 Ви маєте право на одержання будь-яких відомостей про
                        себе у будь-якого суб&#39;єкта відносин, пов&#39;язаних
                        з персональними даними, за умови зазначення прізвища,
                        ім&#39;я та по батькові, місця проживання (місця
                        перебування) і реквізитів документа, що посвідчує
                        фізичну особу, яка подає запит, крім випадків,
                        установлених чинним законодавством України.
                    </p>
                    <p>
                        9.3. Доступ до даних про себе здійснюється безоплатно.
                        Відстрочка доступу до своїх персональних даних не
                        допускається. Відстрочка доступу до персональних даних
                        третіми сторонами допускається у разі, якщо необхідні
                        дані не можуть бути надані протягом тридцяти календарних
                        днів з дня надходження запиту. При цьому загальний
                        термін вирішення питань, порушених у запиті, не може
                        перевищувати сорока п&#39;яти календарних днів.
                    </p>
                    <p>
                        9.4. Повідомлення про відстрочку доводиться до відома
                        третьої особи, яка подала запит, у письмовій формі з
                        роз&#39;ясненням порядку оскарження такого рішення.
                    </p>
                    <p>
                        9.5. Відмова у доступі до персональних даних
                        допускається, у порядку визначеному чинним
                        законодавством України, якщо доступ до них заборонено
                        згідно із Законом України «Про захист персональних
                        даних».
                    </p>
                    <p>
                        9.6. Рішення про відстрочення або відмову у доступі до
                        персональних даних може бути оскаржено до Уповноваженого
                        Верховної Ради України з прав людини або суду.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>
                        10. ВАШІ ПРАВА, ЯК КОРИСТУВАЧА (СУБ’ЄКТА ПЕРСОНАЛЬНИХ
                        ДАНИХ)
                    </SectionTitle>

                    <p>
                        10.1. Ви, як Користувач (суб’єкт персональних даних)
                        маєте право:
                    </p>
                    <p>
                        1) знати про джерела збирання, місцезнаходження своїх
                        персональних даних, мету їх обробки, місцезнаходження
                        Власника або дати відповідне доручення щодо отримання
                        цієї інформації уповноваженим особам, крім випадків,
                        встановлених Законом України «Про захист персональних
                        даних»;
                    </p>
                    <p>
                        2) отримувати інформацію про умови надання доступу до
                        персональних даних, зокрема інформацію про третіх
                        сторін, яким передаються його персональні дані;
                    </p>
                    <p>3) на доступ до своїх персональних даних;</p>
                    <p>
                        4) отримувати не пізніш як за тридцять календарних днів
                        з дня надходження запиту, крім випадків, передбачених
                        Законом України «Про захист персональних даних»,
                        відповідь про те, чи обробляються його персональні дані,
                        а також отримувати зміст таких персональних даних;
                    </p>
                    <p>
                        5) пред’являти вмотивовану вимогу Власнику із
                        запереченням проти обробки своїх персональних даних;
                    </p>
                    <p>
                        6) пред&#39;являти вмотивовану вимогу щодо зміни або
                        знищення своїх персональних даних Власником, якщо ці
                        дані обробляються незаконно чи є недостовірними;
                    </p>
                    <p>
                        7) на захист своїх персональних даних від незаконної
                        обробки та випадкової втрати, знищення, пошкодження у
                        зв&#39;язку з умисним приховуванням, ненаданням чи
                        несвоєчасним їх наданням, а також на захист від надання
                        відомостей, що є недостовірними чи ганьблять Вашу честь,
                        гідність та ділову репутацію;
                    </p>
                    <p>
                        8) звертатися із скаргами на обробку своїх персональних
                        даних до Уповноваженого Верховної Ради України з прав
                        людини або до суду;
                    </p>
                    <p>
                        9) застосовувати засоби правового захисту в разі
                        порушення чинного законодавства України про захист
                        персональних даних;
                    </p>
                    <p>
                        10) вносити застереження стосовно обмеження права на
                        обробку своїх персональних даних під час надання згоди;
                    </p>
                    <p>11) відкликати згоду на обробку персональних даних;</p>
                    <p>
                        12) знати механізм автоматичної обробки персональних
                        даних;
                    </p>
                    <p>
                        13) на захист від автоматизованого рішення, яке має для
                        нього правові наслідки.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>11. ФАЙЛИ COOKIE</SectionTitle>

                    <p>
                        11.1. Наш Сайт використовує файли cookie. Файл cookie –
                        це файл, що містить ідентифікатор (рядок літер та цифр),
                        який веб-сервер надсилає веб-браузеру та зберігає
                        браузер. Потім ідентифікатор надсилається назад на
                        сервер кожного разу, коли браузер вимагає від сервера
                        сторінки. Файли cookie можуть бути як «стійкими» файлами
                        cookie, так і «сеансовими» файлами cookie: стійкий файл
                        cookie буде зберігатися веб-браузером і залишатиметься
                        дійсним до встановленої дати його закінчення, якщо Ви
                        його не видалили до дати закінчення терміну дії; cookie
                        сеанс, з іншого боку, закінчується в кінці сеансу Вашої
                        роботи, коли веб-браузер закриється. Файли cookie, як
                        правило, не містять будь-якої інформації, яка особисто
                        Вас ідентифікує, але особиста інформація, яку ми
                        зберігаємо про Вас, може бути пов&#39;язана з
                        інформацією, що зберігається та отримується від файлів
                        cookie.
                    </p>
                    <p>
                        11.2. Назви файлів cookie, які ми використовуємо на
                        нашому Сайті, та цілі, для яких вони використовуються,
                        викладені нижче: ми використовуємо Google Analytics на
                        нашому Сайті для розпізнавання комп&#39;ютера, коли
                        Користувач відвідує наш Сайт. Більшість браузерів
                        дозволяють Вам відмовитись від прийняття файлів cookie –
                        наприклад: в Internet Explorer (версія 10) Ви можете
                        заблокувати файли cookie, використовуючи параметри
                        керування файлами cookie, натиснувши «Інструменти»,
                        «Параметри Інтернету», «Конфіденційність», а потім
                        «Додатково»; у Firefox (версія 24) Ви можете заблокувати
                        всі файли cookie, натиснувши «Інструменти», «Параметри»,
                        «Конфіденційність», виберіть зі спадного меню пункт
                        «Використовувати власні налаштування для історії» та
                        зніміть галочку «Прийняти файли cookie з сайтів»; і у
                        Chrome (версія 29) Ви можете заблокувати всі файли
                        cookie, відкривши меню «Налаштувати та керувати»,
                        натиснувши «Налаштування», «Показати розширені
                        налаштування» та «Налаштування вмісту», а потім вибрати
                        «Блокувати сайти з налаштування будь-яких даних» «Під
                        заголовком» Cookies «.
                    </p>
                    <p>
                        11.3. Блокування всіх файлів cookie негативно вплине на
                        зручність використання Сайту. Якщо Ви заблокуєте файли
                        cookie, Ви не зможете використовувати всі функції нашого
                        Сайту.
                    </p>
                    <p>
                        11.4. Ви можете видалити файли cookie, які вже
                        зберігаються на вашому комп&#39;ютері. Видалення файлів
                        cookie негативно вплине на зручність використання
                        багатьох веб-сайтів. Для видалення файлів cookie: в
                        Internet Explorer (версія 10) потрібно видалити файли
                        cookie вручну (інструкції щодо цього можна знайти на
                        веб-сайті http://support.microsoft.com/kb/278835 ); у
                        Firefox (версія 24) Ви можете видалити файли cookie,
                        натиснувши «Інструменти», «Параметри» та
                        «Конфіденційність», потім виберіть «Використовувати
                        власні налаштування для історії», натисніть «Показати
                        файли cookie», а потім натисніть «Видалити всі файли
                        cookie» ; і у Chrome (версія 29) Ви можете видалити всі
                        файли cookie, відкривши меню «Налаштувати та керувати»
                        та натиснувши «Налаштування», «Показати розширені
                        налаштування» та «Очистити дані веб-перегляду», а потім
                        вибрати «Видалити файли cookie та інший сайт і плагінні
                        дані», перш ніж натиснути» Очистити дані веб-перегляду.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>12. ЗМІНА ПОЛІТИКИ</SectionTitle>
                    <p>
                        12.1. Ми залишаємо за собою право публікувати окремі
                        примітки про конфіденційність, а також у будь-який час
                        змінювати та/або доповнювати зміст Політики на власний
                        розсуд.
                    </p>
                    <p>
                        12.2. У випадку внесення істотних змін до Політики ми
                        розмістимо повідомлення на Сайті та зазначено термін
                        набрання цими змінами чинності. Якщо протягом
                        зазначеного терміну Ви не відмовитеся від прийняття цих
                        змін в письмовій формі, це означатиме, що Ви погодились
                        з відповідними змінами Політики.
                    </p>
                </Section>
            </Main>
        </>
    );
}

const Main = styled.main`
    padding: 0 20px;
`;

const Section = styled.div`
    margin-bottom: 40px;
`;

const SectionTitle = styled.p`
    font-weight: bold;
    margin-bottom: 10px;
`;
