import Header from '../components/header/Header';
import BackButton from '../components/backButton/backButton';
import PageTitle from '../components/pageTitle/pageTitle';
import styled from 'styled-components';

export default function Oferta() {
    return (
        <>
            <Header title="Оферта" />

            <br />

            <Main>
                <BackButton />

                <br />
                <br />

                <PageTitle title="Оферта" />

                <br />

                <Section>
                    <p>
                        Цей Договір є публічним договором - Договором публічної
                        оферти, тобто відповідно до 633 та 641 статей Цивільного
                        кодексу України його умови однакові для всіх клієнтів
                        сервісу{' '}
                        <a href="https://ChillVGamaky.if.ua">
                            ChillVGamaky.if.ua
                        </a>{' '}
                        (надалі сервіс).
                    </p>
                </Section>

                <Section>
                    <SectionTitle>ПРЕДМЕТ ДОГОВОРУ</SectionTitle>
                    <p>
                        Предмет договору є наданням послух по оренді гамаків та
                        опис взаємодії між сервісом та клієнтом.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>ТЕРМІНИ І ВИЗНАЧЕННЯ</SectionTitle>

                    <p>
                        <strong>Сервіс</strong> - сайт{' '}
                        <a href="https://ChillVGamaky.if.ua">
                            ChillVGamaky.if.ua
                        </a>{' '}
                        який надає клієнту можливість оплатити використання
                        гамака.
                    </p>

                    <br />

                    <p>
                        <strong>Гамак</strong> - продукт, який клієнт бере в
                        тимчасове використання, оплачуване похвилинно після
                        початку використання.
                    </p>

                    <br />

                    <p>
                        <strong>Клієнт</strong>- особа яка бере в оренду гамак,
                        забезпечує його чистоту, охайність, порядність при
                        використанні, зобов’язується виконувати правила які
                        вказані на сайті при використанні гамака.
                    </p>

                    <br />

                    <p>
                        <strong>Точка видачі</strong> - місце, в якому клієнт
                        може взяти у тимчасове використання гамаки.
                    </p>

                    <br />

                    <p>
                        <strong>Послуга</strong> - клієнт самостійно бере у
                        тимчасове використання гамак з точки видачі та після
                        використання приносить його назад.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>ВАРТІСТЬ ПОСЛУХ</SectionTitle>
                    <p>
                        Ціна визначається індивідуально відповідно до місця
                        знаходження точки видачі. Попередньо блокується сума в
                        розмірі 100 гривень з картки клієнти яка буде слугувати
                        оплатою в подальшому.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>ПОРЯДОК ВИКОРИСТАННЯ</SectionTitle>
                    <p>
                        Клієнт приходить до точки видачі, сканує QR код, попадає
                        на сервіс, реєструється через одну з соціальних мереж,
                        бронює гамак, на його картковому рахунку бронюються 100
                        гривень (які будуть використані згодом при оплаті
                        послуги), бере гамак, йде в місце де його інсталює та
                        залазить в нього, заходить на сайт сервісу, натискає
                        “Почати”, використовує гамак. Після закінчення, заходить
                        на сайт знову, натискає “Закінчити”, складає гамак,
                        відносить в точку видачі.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>ОПЛАТА</SectionTitle>
                    <p>
                        Порядок здійснення оплати - клієнт оплачує факт
                        використання гамака. Для цього він натискає “Почати”, і
                        саме це є початком нарахування хвилин які пізніше клієнт
                        оплатить. Взяти гамак з точки видачі, донести до місця
                        експлуатації, проінсталювати не є часом, який потрібно
                        оплачувати клієнту.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН</SectionTitle>

                    <p>
                        <strong>Сервіс</strong>. Зобов’язаний працювати
                        стабільно, без збоїв, надавати статистику користування
                        сервісом клієнту.
                    </p>

                    <br />

                    <p>
                        <strong>Точка видачі</strong>. Зобов’язується зберігати
                        у себе гамаки.
                    </p>

                    <br />

                    <p>
                        <strong>Клієнт</strong>. Зобов’язується відноситись до
                        гамака акуратно, тримати його в чистоті, навантажувати
                        лише тією масою, яка допустима для нього,
                        використовувати лише ремні щоб зберегти кору дерев.
                    </p>
                </Section>

                <Section>
                    <SectionTitle>Строк дії договору</SectionTitle>
                    <p>
                        Від момента оплати депозиту до момента оплати послуги.
                    </p>
                </Section>
            </Main>
        </>
    );
}

const Main = styled.main`
    padding: 0 20px;
`;

const Section = styled.div`
    margin-bottom: 40px;
`;

const SectionTitle = styled.p`
    font-weight: bold;
    margin-bottom: 10px;
`;
